#+TITLE: Build_vendor_table
Goal is to combine ip-asn data from 3 sources
- peeringdb
- shadowserver.org
- pyasn
** Suggestion from zz is to use the beautiful soup library from python
I am going to work through https://zetcode.com/python/beautifulsoup/#:~:text=BeautifulSoup%20is%20a%20Python%20library,%2C%20navigable%20string%2C%20or%20comment.
I will work in the autonums dir

#+BEGIN_SRC tmate :window autonums :dir (concat (getenv "HOME") "/autonums")
sudo pip3 install lxml
#+END_SRC
#+BEGIN_SRC tmate :window autonums :dir (concat (getenv "HOME") "/autonums")
sudo pip3 install bs4
#+END_SRC
#+BEGIN_SRC tmate :window autonums :dir (concat (getenv "HOME") "/autonums")
cat autnums.html | head
#+END_SRC

#+BEGIN_SRC python tmate :window python
#print('Please wait')
return 'A line of text.\n'
#+END_SRC
#+BEGIN_SRC python
return 'A line of text.\n'
#+END_SRC
#+RESULTS:
#+begin_example
/home/ii/ii/org/research
#+end_example
** Post process org blocks
Just making sure we can get to json
#+NAME: json-res
#+BEGIN_SRC sql-mode :var json-r=""
select data from peeringdb.ixlan limit 1;
#+END_SRC

#+RESULTS: json-res
#+begin_SRC example
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}

#+end_SRC

Dang it I am missing something here....
#+BEGIN_SRC shell :process_r yes :post json-res[:process_r yes](*this*)
jq '.'
#+END_SRC

#+RESULTS:
#+begin_example
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}
#+end_example

** Wrap header for json.
#+BEGIN_SRC sql-mode :results sql :wrap EXPORT json
select data from peeringdb.ixlan limit 1;
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}

#+end_EXPORT

